[Killed] BlockStatement
authz.ts:6:64
 export type Role = "admin" | "member";
 export type Action = "read" | "delete";
 
-export function canAccess(role: Role, action: Action): boolean {
-  if (role === "admin") return true;
-  return action === "read";
-}
+export function canAccess(role: Role, action: Action): boolean {}
 
killedBy: canAccess (strong) lets an admin read
statusReason: expected undefined to be true // Object.is equality

[Killed] EqualityOperator
authz.ts:7:7
 export type Action = "read" | "delete";
 
 export function canAccess(role: Role, action: Action): boolean {
-  if (role === "admin") return true;
+  if (role !== "admin") return true;
   return action === "read";
 }
killedBy: canAccess (strong) lets an admin delete
statusReason: expected false to be true // Object.is equality

[Killed] ConditionalExpression
authz.ts:7:7
 export type Action = "read" | "delete";
 
 export function canAccess(role: Role, action: Action): boolean {
-  if (role === "admin") return true;
+  if (true) return true;
   return action === "read";
 }
killedBy: canAccess (strong) denies a member from deleting
statusReason: expected true to be false // Object.is equality

[Killed] EqualityOperator
authz.ts:8:10
 
 export function canAccess(role: Role, action: Action): boolean {
   if (role === "admin") return true;
-  return action === "read";
+  return action !== "read";
 }
 
killedBy: canAccess (strong) lets a member read
statusReason: expected false to be true // Object.is equality

[Killed] ConditionalExpression
authz.ts:8:10
 
 export function canAccess(role: Role, action: Action): boolean {
   if (role === "admin") return true;
-  return action === "read";
+  return true;
 }
 
killedBy: canAccess (strong) denies a member from deleting
statusReason: expected true to be false // Object.is equality
