[Killed] BlockStatement
discount.ts:3:73
 // M8 calibration fixture (#72 §M8) — the WEAK-test-covered source. See
 // discount.tautological.test.ts for the planted weak test (M8-P-TAUTOLOGICAL).
-export function applyDiscount(total: number, isMember: boolean): number {
-  if (total < 0) throw new Error("total must be non-negative");
-  if (!isMember) return total;
-  if (total >= 100) return total * 0.8; // members get 20% off orders >= 100
-  return total * 0.9; // members get 10% off smaller orders
-}
+export function applyDiscount(total: number, isMember: boolean): number {}
 
killedBy: applyDiscount (weak) gives members a discount on a big order
statusReason: expected undefined to be 80 // Object.is equality

[Killed] EqualityOperator
discount.ts:4:7
 // M8 calibration fixture (#72 §M8) — the WEAK-test-covered source. See
 // discount.tautological.test.ts for the planted weak test (M8-P-TAUTOLOGICAL).
 export function applyDiscount(total: number, isMember: boolean): number {
-  if (total < 0) throw new Error("total must be non-negative");
+  if (total >= 0) throw new Error("total must be non-negative");
   if (!isMember) return total;
   if (total >= 100) return total * 0.8; // members get 20% off orders >= 100
killedBy: applyDiscount (weak) gives members a discount on a big order
statusReason: total must be non-negative

[Killed] ConditionalExpression
discount.ts:4:7
 // M8 calibration fixture (#72 §M8) — the WEAK-test-covered source. See
 // discount.tautological.test.ts for the planted weak test (M8-P-TAUTOLOGICAL).
 export function applyDiscount(total: number, isMember: boolean): number {
-  if (total < 0) throw new Error("total must be non-negative");
+  if (true) throw new Error("total must be non-negative");
   if (!isMember) return total;
   if (total >= 100) return total * 0.8; // members get 20% off orders >= 100
killedBy: applyDiscount (weak) gives members a discount on a big order
statusReason: total must be non-negative

[Killed] ConditionalExpression
discount.ts:5:7
 // discount.tautological.test.ts for the planted weak test (M8-P-TAUTOLOGICAL).
 export function applyDiscount(total: number, isMember: boolean): number {
   if (total < 0) throw new Error("total must be non-negative");
-  if (!isMember) return total;
+  if (true) return total;
   if (total >= 100) return total * 0.8; // members get 20% off orders >= 100
   return total * 0.9; // members get 10% off smaller orders
killedBy: applyDiscount (weak) gives members a discount on a big order
statusReason: expected 100 to be 80 // Object.is equality

[Killed] BooleanLiteral
discount.ts:5:7
 // discount.tautological.test.ts for the planted weak test (M8-P-TAUTOLOGICAL).
 export function applyDiscount(total: number, isMember: boolean): number {
   if (total < 0) throw new Error("total must be non-negative");
-  if (!isMember) return total;
+  if (isMember) return total;
   if (total >= 100) return total * 0.8; // members get 20% off orders >= 100
   return total * 0.9; // members get 10% off smaller orders
killedBy: applyDiscount (weak) gives members a discount on a big order
statusReason: expected 100 to be 80 // Object.is equality

[Killed] ArithmeticOperator
discount.ts:6:28
 export function applyDiscount(total: number, isMember: boolean): number {
   if (total < 0) throw new Error("total must be non-negative");
   if (!isMember) return total;
-  if (total >= 100) return total * 0.8; // members get 20% off orders >= 100
+  if (total >= 100) return total / 0.8; // members get 20% off orders >= 100
   return total * 0.9; // members get 10% off smaller orders
 }
killedBy: applyDiscount (weak) gives members a discount on a big order
statusReason: expected 125 to be 80 // Object.is equality

[Killed] EqualityOperator
discount.ts:6:7
 export function applyDiscount(total: number, isMember: boolean): number {
   if (total < 0) throw new Error("total must be non-negative");
   if (!isMember) return total;
-  if (total >= 100) return total * 0.8; // members get 20% off orders >= 100
+  if (total < 100) return total * 0.8; // members get 20% off orders >= 100
   return total * 0.9; // members get 10% off smaller orders
 }
killedBy: applyDiscount (weak) gives members a discount on a big order
statusReason: expected 90 to be 80 // Object.is equality

[NoCoverage] ArithmeticOperator
discount.ts:7:10
   if (total < 0) throw new Error("total must be non-negative");
   if (!isMember) return total;
   if (total >= 100) return total * 0.8; // members get 20% off orders >= 100
-  return total * 0.9; // members get 10% off smaller orders
+  return total / 0.9; // members get 10% off smaller orders
 }
 
