[Survived] BlockStatement
vacuous.ts:6:51
 // mutation of this logic can ever fail it. Distinct from the M8-P-DELETION-SURVIVING pair
 // (audit-log.ts): that one is scored by stub-check's deletion-survival execution; this one is
 // scored by real Stryker mutation testing — the coveredBy/killedBy join #1100 adds.
-export function gradeScore(score: number): string {
-  if (score >= 90) return "A";
-  if (score >= 80) return "B";
-  return "F";
-}
+export function gradeScore(score: number): string {}
 

[Survived] EqualityOperator
vacuous.ts:7:7
 // (audit-log.ts): that one is scored by stub-check's deletion-survival execution; this one is
 // scored by real Stryker mutation testing — the coveredBy/killedBy join #1100 adds.
 export function gradeScore(score: number): string {
-  if (score >= 90) return "A";
+  if (score > 90) return "A";
   if (score >= 80) return "B";
   return "F";

[Survived] ConditionalExpression
vacuous.ts:7:7
 // (audit-log.ts): that one is scored by stub-check's deletion-survival execution; this one is
 // scored by real Stryker mutation testing — the coveredBy/killedBy join #1100 adds.
 export function gradeScore(score: number): string {
-  if (score >= 90) return "A";
+  if (true) return "A";
   if (score >= 80) return "B";
   return "F";

[Survived] EqualityOperator
vacuous.ts:8:7
 // scored by real Stryker mutation testing — the coveredBy/killedBy join #1100 adds.
 export function gradeScore(score: number): string {
   if (score >= 90) return "A";
-  if (score >= 80) return "B";
+  if (score > 80) return "B";
   return "F";
 }

[Survived] EqualityOperator
vacuous.ts:8:7
 // scored by real Stryker mutation testing — the coveredBy/killedBy join #1100 adds.
 export function gradeScore(score: number): string {
   if (score >= 90) return "A";
-  if (score >= 80) return "B";
+  if (score < 80) return "B";
   return "F";
 }

[NoCoverage] StringLiteral
vacuous.ts:9:10
 export function gradeScore(score: number): string {
   if (score >= 90) return "A";
   if (score >= 80) return "B";
-  return "F";
+  return "";
 }
 
